#@ # 
#@ # Running icc2_shell Version T-2022.03-SP2 for linux64 -- May 31, 2022
#@ # Date:   Sun Apr 26 19:50:17 2026
#@ # Run by: lu282362@net1583
#@ 

source pd_soc.tcl
connect_pg_net
report_qor > "$design_path/qor.rpt"
save_block -as routeopt
write_verilog "./results/${design_name}.pd.v"
write_parasitics -output "./${design_name}.pd.spef"
write_sdc -output "./results/${design_name}.pd.sdc"
write_def "./results/${design_name}.pd.def"
write_gds "./results/${design_name}.pd.gds" -hierarchy all -merge_gds_top_cell $design_name
